tutorials/windAroundBuildingsSteady/constant/inflowProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  6
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      inflowProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


Naxis       ( 0 0 0 );
offset      ( 0 0 0 );

// mean velocity

UDict
{
    referenceValue          1;
    profile                 exponential;
    refDistance             10;
    alpha                   0.05;
}

// Reynolds stress

RDict
{
    referenceValue          (1 0  0  0.75  0  0.5);
    profile                 exponential;
    refDistance             10;
    alpha                   (-0.2 -0.2 -0.2);
}

// integral length scale

LDict
{
    referenceValue          (10  8  6);
    profile                 exponential;
    refDistance             10;
    alpha                   (0.1 0.1 0.1);
}



// ************************************************************************* //
